Revit 2024 API
BuiltInFailures.ImageFailures Members
Provides a container of all Revit built-in FailureDefinitionId instances.
The BuiltInFailures.ImageFailures type exposes the following members.
Properties
Name | Description
BadViewType
 Image Instances can't be placed in 3D Views.
InvalidHeight
 The image height must be must be no more than 30000 feet.
InvalidWidth
 The image width must be must be no more than 30000 feet.
See Also
BuiltInFailures.ImageFailures Class
Autodesk.Revit.DB Namespace